# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь,
# ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'],
# 'П': ['Петр', 'Петр']}


def f_dict(name):
    my_dict = {}
    for i in sorted(name):
        if i[0] not in my_dict:
            my_dict[i[0]] = [i]
        my_dict[i[0]] += [i]

    return my_dict


my_ls = ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"]
print(f_dict(my_ls))
